let movies = [
  
  {
    
    image : "ertugrul.jpg",
    name : "قيامة ارطغرل" ,
    category : "action",
    details : " قيامة أرطغرل (بالتركية: Diriliş: Ertuğrul ، هو مسلسل تاريخي تركي من كتابة وإنتاج محمد بوزداغ وإخراج متين جوناي، تقع أحداثه في القرن الثالث عشر الميلادي، ويعرض مقدمات ودوافع تأسيس الدولة العثمانية من عرض سيرة حياة الغازي أرطغرل بن سليمان شاه، قائد قبيلة قايي من أتراك الأوغوز المسلمين ووالد عثمان الأول مؤسس الدولة العثمانية. وقام بدور أرطغرل الممثل التركي إنجين ألتان دوزياتان في 150 حلقة، وخمسة مواسم بعد أن شاهده نحو 3 مليارات مشاهد في العالم، وبث عبر شاشات في 71 دولة، مدبلجاً إلى 25 لغة مختلفة، أبرزها العربية، والإنجليزية والأوردية. عُرضت الحلقة الأولى من المسلسل على القناة الأولى التركية تي أر تي 1 ، وبدأ عرض أولى حلقات الموسم الأول من المسلسل في 10 ديسمبر 2014، ثم عُرضت حلقات الموسم الثاني بدءً من 30 سبتمبر 2015، وانتهى في 8 يونيو 2016 عرضت حلقات الموسم الثالث الذي بدأ في 26 أكتوبر 2016 وانتهى في يونيو 2017، ثم بدأ عرض الموسم الرابع في 25 أكتوبر 2017 واستمر عرضه حتى 6 يونيو 2018، ثم بدأ عرض الموسم الخامس والأخير في 7 نوفمبر 2018 وانتهى في 29 مايو 2019 على نفس القناة. عُرض المسلسل أيضًا على قنوات أخرى كثيرة مثل قنوات روسيا ورومانيا وباكستان وإيران وإندونيسيا والمجر واليونان وبلغاريا والبوسنة والهرسك وأذربيجان وأفغانستان وألبانيا وجورجيا وقطر ومقدونيا وسلوفينيا وصربيا وليتوانيا وكرواتيا وبنغلاديش وقنوات أخرى غيرها، كما وتعرض نتفليكس المسلسل باللغة التركية وتتوفر الترجمة باللغتين العربية والإنجليزية." ,
  
  },
 
  {

    image : "sadakatsiz.jpg",
    name : "الخائن" ,
    category :"action",
    details : "تعيش الدكتورة آسيا (جانسو دره) حياة هادئة وسعيدة مع زوجها فولكان (جانير جيندوروك) وابنهما علي (ألب أكار) يتغير هذا الوضع عندما تكتشف أن زوجها على علاقة بشابة منذ سنتين. على آسيا أن تختار بين إنقاذ زواجها أو الانتقام من زوجها الخائن.",
  
  },

  {
    
  image : "avlu.jpg",
  category :"action",
  name : "الفناء" ,
  details :"تدور أحداث المسلسل حول سيدة تدعى دينيز ديمير، تدخل السجن بتهمة الشروع بقتل زوجها، بعد مشادة كلامية تقع بينه وبين ابنته، ليمسك الأب المسدس ويهدد بقتلهن، إذ يسقط المسدس من يده، وتتجه الأم لإبعاده عنه، ويقوم بتعنيفها وضربها، وفجأة تٌطلَق رصاصة عليه من قِبل ابنته إيجام، ويُقبض على الأم والبنت، وتعترف دينيز أثناء التحقيق بإطلاق النار بدلاً من ابنتها. تدخل دينيز ديمير السجن وهي بريئة ومع تسلسل الأحداث يقتل ابن السجينة قدرت اوزتورك (ألب) ابنة دينيز (إيجام) بأمر من امه فتهرب دينيز من السجن وتنتقم لابنتها فتصبح قاتلة بعد أن دخلت إلى السجن وهي بريئة ويُحكم عليها بالمؤبد. ويحكي أيضًا قصص وصراع السجينات عامةً، ويلقي الضوء على الفوضى والفساد المنتشر داخل بيئة السجن، من حيث تسريب الممنوعات، والتجاوزات الخطيرة، ويشوب ضمن هذه الفوضى صراع بين فريقي الرئيسة عذراء والرئيسة قدرت.",

},


{
  image : "cinayetler.jpg",
  category :"action",
  name : "جرائم صغيرة" ,
  details :"تدور قصة المسلسل حول أربع فتيات صديقات (أويا، مروة، بيلين، أرزو) منذ أيام دراستهن للمرحلة الثانوية، ولكن يتفرقن لظروف يتم الإعلان عنها لاحقاً في المسلسل. يعود لم شمل الصديقات الأربعة بعد عودة أويا إلى البلدة التي كانت تعيش فيها قبل انتقالها إلى منطقة أخرى للدراسة، حيث أنها عادت مختلفة نوعاً ما عما كانت عليه، فقد أصبحت طبيبة ذات شأن ومكانة. يجمعن الفتيات الصديقات من جديد مروة وأرزو وبيلين بعد عودة أويا إليهن، ولكن الماضي الذي فرق بينهن في يوم من الأيام يعود من جديد. يتميزن الفتيات بأنهن يملكن قوى خفية لا تعمل إلا إذا اجتمعن معاً. تتوالى أحداث المسلسل في الحلقات الأولى، عند نبش جريمة تم ارتكابها في الماضي من قِبل مفوض قسم الشرطة الذي يدعى (كمال)، ويتضح أن للفتيات الأربع متورطات في هذه الجناية. تبدأ التحريات والتحقيقات في الكشف عن ملابسات الجريمة، ولكن هل سيقمن الصديقات باستخدام قواهن الخفية للتملص من المحاكمة القانونية من جديد كما فعلن بالماضي! أم سيعترفن بها، هذا ما يمكن معرفته عند متابعة حلقات المسلسل.",

},

 {

    image : "destan.jpg",
    category :"action",
    name : "الملحمة" ,
    details : "الملحمة (بالتركية: Destan هو مسلسل تاريخي تركي من بطولة إيبرو شاهين، أديب تيبيلي وسليم بيرقدار. عرض الموسم الأول في 23 نوفمبر 2021 على قناة أي تي في",
  },

 {

    image : "kucuk-gelin-1.jpg",
    name : "زهرة القصر " ,
    category :"drama",
    details : "زهرة طفلة في الرابعة عشرة من عمرها متفوقة في مدرستها، يجبرها والدها على الزواج من شاب من عائلة غنية فتبدأ في العيش مع عائلتها الجديدة في القصر الكبير وتعاني من الألم العاطفي حيث يعاملها الجميع بقسوة، لذلك تقرر ترك كل شيء وراءها في محاولة للبعد عن هذه الحياة التي لم تخترها لنفسها، ولكن فُرضت عليها فرضًا. ومن ثم تلتقي بأمها وهي التي كانت معلمتها بالسابق علمت بأن زهرة إبنتها فحاولتا الهرب وحملت زهرة من زوجها علي بعدها هربت هي وإبنها وأمها وكما ان امها احبت عزة لكن القدر فرقهما فتزوجت من عدنان اغا الذي اهانها بشدة هي وزهرة وفي كل مرة كانتا تهربان وعدنان يرجعهما من جديد. لكن ملك تهربها للمرة الاخيرة ومع الاسف الظروف تسوء فتقتل ملك وايضا عزة فتهرب زهرة مع ابنها إلى إسطنبول وتهرب ملك من المشتشفى للبحت عنه، لكن علي وعدنان يلحقان بها فيتوه الكل باحثاً عن الأخر إلى أن تجد ملك زوجها السابق أب زهرة وتدور الاحداث في الجزء الرابع والاخير."  ,
  },


{
  image : "hercai.jpg",
  category :"drama",
  name : "زهرة الثالوث" ,
  details :"ميران الذي ولد يتيماً وربته جدته عزيزة وزرعت فيه روح الانتقام لوالديه اللذان قتلا على يد (هزار شاد أوغلو) كما تزعم جدته عزيزة. وظل على هذا الحال إلى أن أتى الوقت للانتقام من عائلة شاد أوغلو. تزوج ريان شاد أوغلو بعد أن دخلت قلبه بعض الشيء ولكن جدته ذكرته بإنتقامه فتركها في اليوم التالي لداعي الانتقام فلم يطاوعه قلبه بفعل ذلك فعاد إليها ومن هنا تبدأ قصة الحب المستحيل بين المطرقة والسندان. أولئك الذين يعتقدون أن القصة تنتهي هنا لا يدرون بأن الحب كبذرة في تربة الانتقام بطولة : أكين أكينوزو ، أيدا أكسل ، إبرو شاهين",

},

{
  image : "istanbullu gelin.jpg",
  category :"drama",
  name : "عروس اسنطبول" ,
  details :"يقع «فاروق» و«ثريا» في الحب في أحد بقاع إسطنبول، وتزوجا وانتقلا إلى منزل عائلة فاروق في بورصة. تحاول ثريا دائمًا كسب عواطف حماتها التقليدية، التي لم تترك جدران قصرها أبدًا، وتدير أسرتها بقواعدها الخاصة، ومن ناحية أخرى، يبدأ ماضي فاروق بملاحقته.",

},

{
  image : "sefirin kizi.jpg",
  category :"drama",
  name : "ابنة السفير" ,
  details :"سنجار الشاب الريفي الفقير وناره ابنة السفير التركي الثري، أحبّوا بعضهما البعض بجنون منذ الصغر، لكن والد ناره عارض علاقتهما بسبب الفروق الحياتية بينهما. فقررا الفرار والزواج سراً. شك سنجار في الليلة التي تلت زفافه أن ناره قد خانته ولا يصدق كلماتها، فأخرجها من كوخهما. فترمي ناره بنفسها من على حافة الهاوية وتصاب بجروح خطيرة. وتختفي بعد ذلك، فأصبحت قصتهما ملحمة يعرفها كل سكان موغلا وهي قرية سنجار. وفي بال سنجار أن ناره تركته بسهولة وخانته، لكن ظنه كان خاطئ، فتلك المرأة تعرضت للاغتصاب من قبل أخاها بالتبني المدعو بأكين في عيدها الثامن عشر، وبعد سنوات، عادت ناره إلى حياة سنجار ومعها طفلتها ملاك ابنة سنجار. حيث تظهر في الوقت الذي يخطط فيه سنجار للزواج لإرضاء أمه، وتقرر ناره بدء حياة جديدة، وفي حين أن سنجار لم يستطع تصديقها لتعرضه للخداع من قبلها لكن في داخله ما زال حبها موجود، ويوجد أيضا غديز صديق سانجار وشريكه ويصبح صديق ناره ويبقى بجانبها ويساندها ويصدقها دون أي مقابل أو اشتراطات ليبدأ هو الآخر بحبه المأساوي لحبيبة صديقه في الخفاء ومحاولاته لتناسي مشاعره تجاهها وتستمر ناره بحبها لسانجار رغم كل المصاعب والأذى الذي لحق بها منه.",

},

 {

    image : "yeni-gelin-1.jpg",
    name : "العروس الجديدة" ,
    category:"comedy",
    details : " تدور أحداث مسلسل العروس الجديدة حول حياة اثنين من العشاق كل منهما نشأ نشأة مختلفة عن الآخر، ولكن مع هذا يتحديان الكثير من الصعاب التي تعترضهما ويقرران الزواج[٣]، هؤلاء كل من الشابة بيلا (جيسيكا ماي) تلك الفتاة المتعلمة والمثقفة والمولودة في مدينة ميلانو في إسبانيا، والتي تنحدر من عائلة ذات أصول أرستقراطية، وهي الابنة الوحيدة لأب يعمل سفير لبلده تركيا وأم إسبانية تنتمي إلى المجتمع الراقي، هذه الشابة تلتقي بحب حياتها الشاب هزار (تولغا ميندي) وهو شاب ينحدر من عائلة بوزوك من مدينة أضنة في شرق تركيا." ,
  
 },
 




{
  image : "kalp atisi.jpg",
  category :"comedy",
  name : "نبضات قلب" ,
  details :"القصة تبدأ حين تطرد ايلول من المدرسة بسبب سلوكها العدواني فهي متقنة للفنون القتالية ويأخذها والدها مجبرا اياها العيش عند جدتها بطلب من زوجته تأخذها جدتها وتضعها في مدرسة حيث يدرس فيها أستاذ يدعى علي اساف فتصبح أسماء صديقتها المفضلة وبهار تكرهها لأن الاستاذ علي يغرم بأيلول في حين بهار تحب أستاذ علي. ترك الأستاذ علي الجراحة بعد عملية فاشلة وأصبح يدرّس في المدرسة، واجتمع بعد عدة سنوات مع بايلول في المستشفى، وبدأت وقتها الأحداث المشوقة.",

},

{
  image : "kiraz mavisimi.jpg",
  category :"comedy",
  name : "موسم الكرز" ,
  details :"القصة تبدأ حين تطرد ايلول من المدرسة بسبب سلوكها العدواني فهي متقنة للفنون القتالية ويأخذها والدها مجبرا اياها العيش عند جدتها بطلب من زوجته تأخذها جدتها وتضعها في مدرسة حيث يدرس فيها أستاذ يدعى علي اساف فتصبح أسماء صديقتها المفضلة وبهار تكرهها لأن الاستاذ علي يغرم بأيلول في حين بهار تحب أستاذ علي. ترك الأستاذ علي الجراحة بعد عملية فاشلة وأصبح يدرّس في المدرسة، واجتمع بعد عدة سنوات مع بايلول في المستشفى، وبدأت وقتها الأحداث المشوقة.",

},



{
  image : "kcak gelinler.jpg",
  category :"comedy",
  name : "العروسات الهاربات " ,
  details :"يناقش مسلسل عروسات هاربات فكرةالزواج والحب البحث عن رجل الأحلام، إذ تحكي قصة مسلسل عروسات هاربات قصة ثلاث نساء، واحدة تهرب من بروفة فستان الزفاف، وواحدة من على طاولة الزفاف، وواحدة من قاعة الزفاف؛ تتقاطع طرق النساء الثلاث ألميا وشبنام وكينات في مطار إزمير عدنان مندريس، حيث يهربن لمواكبة حياتهن.",

},

{
  image : "Kardeslerim.jpg",
  category :"drama",
  name : "اخوتي" ,
  details :"يتحدث المسلسل عن الأخوة الأربعة وكفاحهم من أجل الحياة، كانوا يعيشون حياة سعيدة مع والديهم، كانوا فقراء بجيوب فارغة لكن قلوبهم مليئة بالحب، وتنقلب حياتهم بيوم مظلم أظلم حياتهم وتركهم وحيدين بدون والديهم.",

},



{
  image : "flames of fate.jpg",
  category :"drama",
  name : "اللهيب" ,
  details :"يحكي المسلسل قصة ثلاث نساء، تتغير حياتهن بعد حريق يندلع خلال حفل خيري، وهن «جميري» المتزوجة من «شلبي» رئيس البلدية السابق، وتتعرض للتعنيف والظلم ويدّعي زوجها أنها مريضة نفسية، وأنها حاولت الانتحار، ويستخدم نفوذه لمنع المحامين من تولي قضية الطلاق التي تريد أن ترفعها ضده، ويهددها بأخذ طفلتها خارج البلاد حتى تصمت عن حقها.",

},

{
  image : "baht oyunu.jpg",
  category :"comedy",
  name : "لعبة الحظ" ,
  details :"تقع ادا في حب روزجار وهو طالب في جامعتها من ألبانيا مهدد بالترحيل من البلاد. إعتقاداً منها أن روزجار هو حبها الأول، تتقدم للزواج منه ويتزوجان زواجاً مزيفاً حتى يستطيع البقاء ولا يتم ترحيله. تؤمن ادا أن روزجار سوف يتقدم لها رسمياً في الذكرى الثالثة من زواجهما المزيف وحينها ستبدأ أخيراً مغامرة زواجهما الحقيقي. لكن لسوء الحظ، ستذهب كل أحلام وآمال ادا في مهب الريح حين يتركها روزجار في الذكرى الثالثة من زواجهما. سرعان ما تسعى ادا لإستعادة روزجار لأنها تعتقد أنه إذا هجرها حبها الأول، فإنها ستكون تعيسة إلى الأبد. لكن القدر له طريقته الخاصة وسيضع بورا في طريق ادا في لحظة غير متوقعة وهو رجل مدمن على العمل وقاسي ومغرور مع أبوابٍ مغلقة بأحكام للحب",

},

{

image : "love bird.jpg",
category : "comedy",
name : "طائر النمنمة",
details : "قصة مسلسل طائر النمنمة هو مسلسل تركي درامي رومانسي داخل إطار تاريخي، وهو من المسلسلات العائلية، يتكون من جزء واحد يضم اثنين وسبعين حلقة تصل مدة الحلقة الواحدة إلى حوالي ساعتين، تم إنتاج مسلسل طائر النمنمة عام 2013 من إخراج دوغان أوميت كراجة (Doğan Ümit Karaca)، وجان ارماك (Çağan Irmak، وبطولة بوراك أوزجيفيت Burak Özçivit، وفخرية أوجن Fahriye Evcen، وإيرول أيدين Erol Aydin، وصورت مشاهد المسلسل في مدينة إسطنبول، وحقق المسلسل نجاح كبير حيث حقق نسبة عالية في المشاهدة، كما حصل على تقييم 7. 4 من 10، ويذكر أن المسلسل تم اقتباسه من رواية طائر النمنمة Çalikusu، والتي كتبها الكاتب رشاد نوري غونتكين في عام 1922.",

},

{
image : "ask laftan anlmaz.jpg",
category : "comedy",
name : "الحب لا يفهم الكلام ",
details : "تدور أحداث المسلسل عن حياة (هاندا ارتشيل) التي ولدت في غيرسون وتعيش برفقة صديقتيها في إسطنبول. بدأت حياة بالعمل كمساعدة لمراد سارسيلماز (بوراك دنيز) -وريث عائلة إمبراطور المنسوجات- في الشركة. يتم سرد القصة اللطيفة للقاء مراد مع حياة الذي يبدأ بالمعركة ويستمر بالحب.",

},

{

  image : "annem.jpg",
  category : "drama",
  name : "امي",
  details : "تحكى القصة عن امراة اسمها زينب تتزوج من زميل لها الجامعة اسمه موسى ويعيشان حياة سعيدة، ثم يخونها موسى مع امراة أخرى وتظهر فضيحته في الجرائد ومعه أخوه إبراهيم ثم تترك زينب بيتها وترحل ويفترقا وتكتشف حملها في نفس يوم خيانتها لزوجها، وبعد 16 عام تكبر ابنة موسى وزينب والتي تسمى نجوى وتسكن هي وامها في بيت بجانب أحد الأسواق الشعبية وتعمل زينب ببيع الكفتة وتجد عملاً آخر في أحد شركات البناء الشهيرة، ويصبح موسى وزيرا للإسكان ويحب أحد المذيعات المشهورات التي تسمى عائشة. ثم تذهب نجوى إلى بيت خالها محمد الذي يحب أحد بائعات السوق الشعبي التي سيتزوجها فيما بعد وذهبت نجوى إليه لتشكو من أن أمها تريد بيع بيتها، وفي نفس الوقت تكون زينب في قسم البوليس يرافقها جارها علىِ الذي يعمل شرطيا لظنها ان نجوى اختطفت، حينها يكون أحد الصحفيين لذين يعملون في قناة عائشة يسجل حلقة عن أعمال رجال الشرطة فيعرف أمر نجوى وامها ويذهب بالخبر إلى عائشة وتخبر موسى ثم تتوالى الاحداث.",
  
  },

  {
  image : "mucize doktor.jpg",
  category : "action",
  name : "الدكتور المعجزة",
 details : "تدور أحداث المسلسل حول الطبيب علي وفاء الذي ولد مصابًا بالتوحد بالإضافة لمتلازمة الموهوب وعن الأحداث التي يعايشها كطبيب موهوب ترافقه بعض المُعيقات خصوصًا من ناحية التواصل اجتماعيًا، يتخلل ذلك العودة لأحداث ماضية عاشها علي صغيرًا والتي كانت دافعًا أساسيًا لدراسته الطب. ولد علي وفاء ضمن أسرة فقيرة ومتواضعة كانت حالته سببًا في اضطراب العائلة خصوصًا من جهة والده، يبرز ضمن الأحداث نفوق الأرنب الذي كان علي يحبه كثيرًا، كذلك تعرّضه هو وأخوه الأكبر لحادث في كهفٍ مهجور أدى لوفاة أخوه وقرار والده بالتخلّي عنه لملجئ للأطفال ذلك أنه كان يلومه على هذا الحادث، فقدان علي لأرنبه وأخوه الأكبر كانت دافعًا له ليصبح طبيبًا في المستقبل ليساعد الآخرين، يساعده في ذلك مهارة غير عادية على الحفظ والتذكّر وكذلك قدرة على التحليل وتشخيص الأمراض، لكنه مع ذلك يواجه صعوبات كثيرة من ناحية التواصل اجتماعيًا، بعد التخرّج جرى تعيينه في أحد أكبر المستشفيات بإسنطبول كطبيب جراح مساعد، وذلك بمساعدة الطبيب عادل الذي اهتم به في صغره، وهذا الحال جعله محل جدل دائم بين الأطباء والزملاء كذلك بين بعض المرضى، وعلى هذا المنوال تدور أحداث المسلسل، حيث يتعلم علي وفاء كل يوم مهارة من مهارات التواصل ويشخّص حالات جديدة يصعب على أفضل الأطباء تشخيصها.",
    
 },

 {

  image : "gunes kizilari.jpg",
  category : "drama",
  name : "بنات شمس",
  details : "تدور أحداث المسلسل عن شمس وهي امرأة أربعينية تعمل مـُعلمة أدب تركي، تركها زوجها مع فتياتها الثلاث ورحل منذ زمن فتظن أن الحظ ابتسم لها عند زواجها من فاروق رجل الأعمال الثري الذي تبدو عليه هيئة رجل صالح يحب زوجته وبناتها الثلاث لكن بمرور الوقت يظهر أن هالوك وعائلته ليسا بالمثالية التي تظنها جونيش ويبدأ الغموض يلف تلك العائلة من كل الجهات وتُكتشف الاسرار الخفية المتعلقة بماضي شمس التي تبدأ بالشعور بالندم من زواجها هذا شيئاً فشيئا.",
  
  },

  {

 image : "elkiz.jpg",
 category : "drama",
 name : "الكنة",
 details : "هي فتاة تحلم بتشكيل أسرة مثالية مع هارون كاراسو غير أن الميراث الذي انتظر واستمر لها من أبوها يحول كل شئ.سيحكي عن ايزو التي تيتمت وهي ضئيلة وكبرت بلا حب ، تتبدل مع الزمان لشخصية شريرة ومنتقمة. تحلم بإنشاء أسرة مثالية مع هارون كاراسو غير أن الميراث الذي إنتظر واستمر لها من أبوها يحول كل شئ. رسمياااا انضمام شاغلا شيمشيك و بيريهان سافاش لمسلسل “الكنة” من منافسة سيفدا أرغينجي واسماعيل شاشماز.",
    
 },

 {

  image : "seyah beyaz ask.jpg",
  category : "action",
  name : "حب ابيض و اسود",
  details : "تدور أحداث المسلسل حول بطلة المسلسل أصلي الفتاة الجميلة ذات المشاعر الرقيقة والمحبة للخير، والتي تعيش مع أخيها الشرطي الذي كان لها بمثابة الأب وساعدها في أن تصبح طبيبة، وبطل المسلسل فرحات الذي لا يعرف ما هو الحب، ويمتلك مشاعر قاسية لا ترحم أحدًا، وذلك بسبب طفولته التي عاشها على عكس أصلي تمامًا.",
  
  },

  {
  image : "marasli.jpg",
  category : "action",
  name : "مرعشلي",
  details : " يحكي المسلسل قصة جندي سابق من كهرمان مرعش ترك عمله في القوات الخاصة، واتجه لقضاء حياته في متجر للكتب المستعملة. وكانت نقطة تحول حياة المرعشلي الشجاع والجريء بعد إصابة ابنته زيليش بطلق ناري، ليصبح هدفه الوحيد بعد ذلك إعادة ابنته المريضة",
    
 },

 {

  image : "zemheri.jpg",
  category : "action",
  name : "زمهرير",
  details : "أياز وفيروزة عاشقان سابقان في سنوات الجامعة. والد فيروزة كان مسؤول عن التحكم في المصاعد في نفس الشركة التي كان يعمل بها اياز . يحصل حادث في موقع البناء بسبب خلل في احد المصاعد مما يؤدي إلى وفاة مجموعة من العمال وسيتم القاء اللوم على والد  فيروزة وسيدخل السجن ظلمًا. تغير فيروزة هويتها لتبدأ العمل في نفس الشركة التي كان يعمل فيها والدها ومازال يعمل فيها حبيبها السابق لإثبات براءة ابيها!",
  
  },


];




 function loadDetails() {

  const queryString = window.location.search;
  const urlParams = new URLSearchParams(queryString);
  const movieNumber = urlParams.get('movie')
  console.log(movieNumber);

  let MovieDetailscontainer = document.getElementById("MovieDetails");
  

  MovieDetailscontainer.innerHTML = "";

  
  MovieDetailscontainer.innerHTML +=  `<h1 class="title">${movies[movieNumber].name}</h1><img src="./${movies[movieNumber].image}" alt=""  class="img" ><br><p style="text-align:center ;">${movies[movieNumber].details}</p>`






    }

 function load() {
  let dramacontainer = document.getElementById("drama");
  let actioncontainer = document.getElementById("action");
  let comedycontainer = document.getElementById("comedy");

  dramacontainer.innerHTML = "";
  actioncontainer.innerHTML = "";
  comedycontainer.innerHTML = "";



    movies.forEach(function(item, index) {



       if (item.category == "action") {
        actioncontainer.innerHTML +=  `<div class="col"><div class="container"><img src="./${item.image}" class="card-img-top" alt="" style="width:100%" /><div class="overlay"><a href="http://127.0.0.1:5500/indixin.html?movie=${index}" class="icon" title="commenting Profile"><i class="fa fa-commenting-o"></i></a></div></div><div class="card-body"><h5 class="card-title">${item.name}</h5></div>`
        
      }; if (item.category == "drama") {
        dramacontainer.innerHTML +=  `<div class="col"><div class="container"><img src="./${item.image}" class="card-img-top" alt="" style="width:100%" /><div class="overlay"><a href="http://127.0.0.1:5500/indixin.html?movie=${index}" class="icon" title="commenting Profile"><i class="fa fa-commenting-o"></i></a></div></div><div class="card-body"><h5 class="card-title">${item.name}</h5></div>`

    }; if (item.category == "comedy") {
      comedycontainer.innerHTML +=  `<div class="col"><div class="container"><img src="./${item.image}" class="card-img-top" alt="" style="width:100%" /><div class="overlay"><a href="http://127.0.0.1:5500/indixin.html?movie=${index}" class="icon" title="commenting Profile"><i class="fa fa-commenting-o"></i></a></div></div><div class="card-body"><h5 class="card-title">${item.name}</h5></div>`
    }

 })}







      () => {
        console.log("Im Eman :/ hahahaha !!! ");
      }




      window.onscroll = function() {myFunction()};
  
      var navbar = document.getElementById("navbar");
      var sticky = navbar.offsetTop;
      
      function myFunction() {
        if (window.pageYOffset >= sticky) {
          navbar.classList.add("sticky")
        } else {
          navbar.classList.remove("sticky");
        }
      }

      





       
      